Revit 2026 API

# WaveWaveDistribution Property

---

The property labeled "Distribution" from the "Wave" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WaveDistribution { get; }
```
```vb
Public Shared ReadOnly Property WaveDistribution As String
	Get
```
```cpp
public:
static property String^ WaveDistribution {
	String^ get ();
}
```
```fsharp
static member WaveDistribution : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaveDistributionType".

#### Reference

Wave Class

Autodesk.Revit.DB.Visual Namespace